app/mailers/email_log_observer.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "email_logs" ("user_id", "mailer_class", "mailer_action", "to_email", "subject", "body_html", "created_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def self.delivered_email(message)
    mailer_class = message.delivery_handler&.name || "Unknown"
    mailer_action = message["X-Mailer-Action"]&.value || "unknown"
    to_email = Array(message.to).first
    return unless to_email.present?

    user = User.find_by(email: to_email)
    body_html = message.html_part&.body&.decoded || message.body&.decoded

    EmailLog.create!(
      user: user,
      mailer_class: mailer_class,
      mailer_action: mailer_action,
      to_email: to_email,
      subject: message.subject,
      body_html: body_html
    )