app/controllers/admin/orders_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN ($1, $2, $3)  [["order_id", 716968337], ["order_id", 542471624], ["order_id", 575060544]]
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT "orders".* FROM "orders" WHERE "orders"."status" = $1 ORDER BY "orders"."created_at" DESC  [["status", "pending"]]
SELECT 1 AS one FROM "orders" WHERE "orders"."status" = $1 LIMIT $2  [["status", "pending"], ["LIMIT", 1]]
---
  def index
    @orders = Order.includes(:user, :order_items).recent

    @orders = @orders.by_status(params[:status]) if params[:status].present?

UPDATE "orders" SET "tracking_number" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["tracking_number", "USPS1234567890"], ["updated_at", "2026-06-20 18:53:33.155555"], ["id", 542471624]]
SELECT "orders".* FROM "orders" WHERE "orders"."status" = $1 ORDER BY "orders"."created_at" DESC  [["status", "pending"]]
---
  def update_status
    new_status = params[:status].to_s

    if new_status == "shipped" && params[:tracking_number].present?
      @order.update!(tracking_number: params[:tracking_number])
    end

    @order.transition_to!(new_status)

    if new_status == "shipped"
      OrderMailer.order_shipped(@order).deliver_later

UPDATE "orders" SET "tracking_number" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["tracking_number", "USPS1234567890"], ["updated_at", "2026-06-20 18:48:52.870011"], ["id", 542471624]]
---
  def add_tracking
    if params[:tracking_number].blank?
      flash[:alert] = "Tracking number cannot be blank."
    else
      @order.update!(tracking_number: params[:tracking_number])