app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "slug", "description", "price_cents", "compare_at_price_cents", "category_id", "in_stock", "featured", "position", "meta_title", "meta_description", "meta_keywords", "og_image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT 1 AS one FROM "order_items" WHERE "order_items"."product_id" = $1 LIMIT $2  [["product_id", 926412133], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 926412133]]
---
  def destroy
    if @product.order_items.any?
      flash[:alert] = "Cannot delete: this product has existing orders."
      redirect_to admin_products_path and return
    end

    @product.destroy

UPDATE "products" SET "in_stock" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["in_stock", false], ["updated_at", "2026-06-20 18:50:50.156581"], ["id", 84983394]]
---
  def toggle_in_stock
    @product.update!(in_stock: !@product.in_stock?)

UPDATE "products" SET "featured" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["featured", false], ["updated_at", "2026-06-20 18:52:14.641112"], ["id", 84983394]]
---
  def toggle_featured
    @product.update!(featured: !@product.featured?)

SELECT "products".* FROM "products" WHERE "products"."slug" = $1 LIMIT $2  [["slug", "classic-red-roses"], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find_by!(slug: params[:id])