app/views/account/dashboard/index.html.erb

    <div class="bg-white border border-gray-100 rounded-xl p-5 text-center">
      <p class="text-3xl font-bold text-rose-600"><%= current_user.orders.count %></p>
---
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]

    <div class="bg-white border border-gray-100 rounded-xl p-5 text-center">
      <p class="text-3xl font-bold text-rose-600"><%= current_user.addresses.count %></p>
---
SELECT COUNT(*) FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 2]]