app/views/admin/orders/index.html.erb

          class: "flex-1 min-w-48 border border-gray-200 rounded-lg px-4 py-2 text-sm focus:outline-none focus:ring-2 focus:ring-rose-300" %>
      <%= f.select :status, [["All Statuses", ""]] + Order::STATUSES.map { |s| [s.humanize, s] },
          { selected: params[:status] },
          class: "border border-gray-200 rounded-lg px-3 py-2 text-sm focus:outline-none focus:ring-2 focus:ring-rose-300" %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."status" = $1 ORDER BY "orders"."created_at" DESC  [["status", "pending"]]

              <p class="font-semibold text-gray-900 text-xs"><%= order.order_number %></p>
              <p class="text-xs text-gray-400"><%= pluralize(order.order_items.size, "item") %></p>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN ($1, $2, $3)  [["order_id", 716968337], ["order_id", 542471624], ["order_id", 575060544]]