app/views/admin/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 716968337]]
---
      <div class="space-y-3">
        <% @order.order_items.each do |item| %>