app/views/orders/index.html.erb

SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 716968337]]
---
          <div class="flex items-center justify-between text-sm text-gray-500">
            <span><%= pluralize(order.order_items.size, "item") %></span>