app/controllers/application_controller.rb

  def track_visitor
    return if devise_controller?
    store_utm_in_session if params[:utm_source].present?

    PageVisit.create!(
      user: current_user,
      landing_url: request.original_url,
      referring_url: request.referer,
      utm_source: session[:utm_source],
      utm_medium: session[:utm_medium],
      utm_campaign: session[:utm_campaign],
      ip_address: request.remote_ip,
      user_agent: request.user_agent
    )
---
INSERT INTO "page_visits" ("user_id", "landing_url", "referring_url", "utm_source", "utm_medium", "utm_campaign", "ip_address", "user_agent", "created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"