app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders.recent
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."created_at" DESC  [["user_id", 567506384]]

  def show
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 567506384], ["id", 716968337], ["LIMIT", 1]]

  def find
    email = params[:email].to_s.strip.downcase
    order_number = params[:order_number].to_s.strip.upcase

    @order = Order.find_by(email: email, order_number: order_number)
---
SELECT "orders".* FROM "orders" WHERE "orders"."email" = $1 AND "orders"."order_number" = $2 LIMIT $3  [["email", "[FILTERED]"], ["order_number", "BB-0000-00000"], ["LIMIT", 1]]