app/controllers/products_controller.rb

  def index
    @products = Product.in_stock.ordered
    @categories = Category.active.ordered
    @current_category = nil

    if params[:category].present?
      @current_category = Category.active.find_by(slug: params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."active" = $1 AND "categories"."slug" = $2 LIMIT $3  [["active", true], ["slug", "bouquets"], ["LIMIT", 1]]

  def show
    @product = Product.find_by!(slug: params[:id])
    @related_products = Product.in_stock.where(category: @product.category).where.not(id: @product.id).limit(4)
---
SELECT "products".* FROM "products" WHERE "products"."slug" = $1 LIMIT $2  [["slug", "nonexistent-slug"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."in_stock" = $1 AND "products"."category_id" = $2 AND "products"."id" != $3 LIMIT $4  [["in_stock", true], ["category_id", 99472577], ["id", 84983394], ["LIMIT", 4]]